In [42]:
%pylab inline
import twx

Populating the interactive namespace from numpy and matplotlib

/usr/local/lib/python3.5/dist-packages/IPython/core/magics/pylab.py:160: UserWarning: pylab import has clobbered these variables: ['table']
`%matplotlib` prevents importing * from pylab and numpy
  "\n`%matplotlib` prevents importing * from pylab and numpy"

In [43]:
date = '20150211'
ticker = 'AAPL'
event = 'time: 11am 11:05am 5m'
query = 'daily.open'
data = twx.bookquery(date, ticker, event, query)
data.columns = ['close']

#plot(data.mid, color='g')

In [44]:
data.head()

                      close
datetime
2015-02-11 11:00:00  112.98

In [45]:
sdate = datetime.date(2014, 8, 12)   # start date
edate = datetime.date(2014, 8, 14)   # end date

dates = [sdate + datetime.timedelta(days=i) for i in range((edate - sdate).days + 1)]

table = [[date, 'AAPL'] for date in dates]
twx.bookjoin(table, 'daily.open' ,symbol= 'msft' ,date= '20150120' )

            0     1  daily.open
0  2014-08-12  AAPL      41.453
1  2014-08-13  AAPL      41.453
2  2014-08-14  AAPL      41.453

In [ ]:
P = 100